posts/2004-travel-camps.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-21 Tue 14:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>(Short story) Travel Camps</title>
<meta name="generator" content="Org mode" />
<link rel='stylesheet' type='text/css' href='../css/default.css' />
<link rel='stylesheet' type='text/css' href='../css/style.css' />
<link rel='stylesheet' type='text/css' href='../css/code.css' />
<meta name='viewport' content='width=device-width, initial-scale=1.0' />
</head>
<body>
<div id="preamble" class="status">
<div class="header">
  <a href="../index.html">
    <span class="actondev act">ACT</span><span class="actondev on">ON</span><span class="actondev dev">DEV</span>
  </a>
  <span>Development, philosophy, writing</span>
</div>
<h1 class='title'>(Short story) Travel Camps<br/><span class='subtitle'>My first short story. Dedicated to my muse (look: 04 and 21)</span><br/><span class='subtitle date'>2020-04-21</span></h1>
</div>
<div id="content">

<div id="outline-container-org08446bc" class="outline-2">
<h2 id="org08446bc">Day 3</h2>
<div class="outline-text-2" id="text-org08446bc">
<blockquote>
<p>
I just returned home. Oh, how I missed this place. This smell. Old
tiles, old furniture, plant soil and food. Here, everything has a
purpose. My movements have a meaning.
</p>

<p>
My first encounter with another person, talking about my trip was at
the office.
</p>
<ul class="org-ul">
<li>Colleague: So.. how was the trip?</li>
<li>Me: It was fine. We had a good time</li>
</ul>

<p>
That's what you're supposed to say, no? I couldn't really bother
going into details. And, more importantly, I didn't know how to
express my mind. And on top of that, I didn't know what my mind
was thinking exactly.
</p>

<ul class="org-ul">
<li>Colleague: Hey, so did u try it?</li>
<li>Me: Huh?</li>
<li>Colleague: The durian fruit.</li>
<li>Me: Ah, no. Didn't occur.</li>
</ul>

<p>
So what the fuck did I do there? Well.. I did have a good
time. Visiting an exotic place.. but.. that's it? My gut is telling
me that everything about this trip, the flights, thousands of
kilometers flown across the globe using an airplane.. a freaking
airplane.. was it all for me to taste some exotic food, take
pictures with elephants and.. "have a good time"?
</p>
</blockquote>

<p>
He put the book aside. The sun was hot and it was one of those hours
that there was nothing to do in the camp. He was just lying in his
hammock for the time being. The book was free to borrow from the
reception. The writing was sparse, and people were saying that it
didn't make much sense. He couldn't really bother with these
critiques, he was interested in the psychology of the man. And his
own memoirs seemed the best means to that since every piece of
article he would read was extremely biased and colored - from either
sides.
</p>

<p>
He got up from the hammock. He wanted to take a stroll around. Since
he arrived, it was quite weird actually. The moment he got off the
plane, some guards with white whole-body suits and masks welcomed
them and guided them to a bus in which they drove for like 30 minutes
away from the airport. There they reached the place where, as they
told them, they had to stay for a week.
</p>

<p>
The place was like some prisons you see on the television or the
movies. Cells arranged in a square shape all around the middle
common room. There was also a library, and an outside
yard. Hmm.. "like" a prison.. seems weird but it feels that it was
always like this. Even his parents went through this. But 100 years
ago it wasn't like that.
</p>

<p>
His thoughts were interrupted by a voice coming from a distance 
</p>

<ul class="org-ul">
<li>Hey Mark. [He quickened his pace to reach him] It's me, we were
sitting next to each other on the plane.</li>
<li>Mark: Oh hey.. uhmm, remind me your name..? Sorry i'm not good at this.</li>
<li>Nick: Well, Nicholas, but you can call me Nick.. So what do you
think of this place? It's not bad, right? I mean plenty of people
are complaining, like we are prisoners or something. Slaves
even. But it's not that bad, right? It's like a free hostel"</li>
<li>M: Hostel? I wouldn't really know, it's my first time traveling</li>
<li>N: Oh.. Well they're places to stay, but mostly just
sleep. Cheap ones. You live with like 5 other people in the same
room. It's basically just a bed.. A dormitory! That's the
word. [Pauses for a little bit] But then where are you staying?
You have someone here?</li>
<li>M: Yeah, my uncle lives here. I came to visit him for the summer. He
has a place here by the sea. I have a photo somewhere..</li>
</ul>

<p>
And he showed him the place. A one story house, made mostly out of
wood, with a great view to the sea. By the house there were plants,
vegetables, and some animals.
</p>

<ul class="org-ul">
<li>N: So this guy is self-sufficient right?</li>
<li>M: Yeah, I guess he is.</li>
<li>N: That's nice.. one of the free ones.</li>
</ul>
</div>
</div>

<div id="outline-container-org03556ff" class="outline-2">
<h2 id="org03556ff">Day 4</h2>
<div class="outline-text-2" id="text-org03556ff">
<blockquote>
<p>
You see all these people. Walking aimlessly around the
city. Meaningless. Generic happy faces looking up. Looking at the
trees, the buildings, the fucking pigeons. Everything is looked at
with <b>AWE</b>. Everything is nice and shiny.
</p>

<p>
It's those people you usually have to push. <br />
Push to pass by. <br />
You go from point A to point B. <br />
They roam.
</p>

<p>
I wanna say.. focus people! But no. Impossible. They're currently
busy consuming. "Gather around, dosage time."
</p>

<p>
Don't interrupt. Must not interrupt them. <br />
Should not interrupt them.. frowned upon.
</p>

<p>
They.. they love us - and fill our pockets- They make our economy
run. Cause, god forbid, to have to rely on our own. What fun would
that be? That requires work.
</p>

<hr />

<p>
All these ideas were blowing steam in my head. Were keeping the
engines running. But I was sitting idle. Idle and burning
steam. Quite the internal conflict.
</p>
</blockquote>

<p>
He let the book rest upon his chest and his mind race.
</p>

<p>
"Uhm.. but why would that <b>awe</b> be bad? I remember every time I
visited my uncle's house at the village I would get this feeling
that everything is new. Waiting to be examined. And it's a nice feeling. You
feel new yourself. And I feel that I don't follow him."
</p>
</div>
</div>

<div id="outline-container-orgaecd540" class="outline-2">
<h2 id="orgaecd540">Day 5</h2>
<div class="outline-text-2" id="text-orgaecd540">
<blockquote>
<p>
"So how would you regulate tourism?" was the question to my
friend. The friend with whom I went to Thailand. He must think I'm
weird. Well of course he <b>knows</b> I'm weird, after so many years of
us being friends.
</p>

<p>
So I went on thinking out loud:
</p>
<ul class="org-ul">
<li>Cause in our current system, the way things get handled to adjust
the demand is price. So would you want to adjust tourism, lower it? 
You make it more expensive. But.. that doesn't seem
fair. I mean it would be fair if the income distribution were
without these intense extremes. But.. how do you make
traveling.. flat. For all. Like a basic need, such as access to
bread or education. But also limit it&#x2026; How?..</li>
<li>I don't know, man, like make people fill out an application or
something. You'd have to write something like "I want to visit
India cause I've been fascinated by Buddhism ever since my
youth." And then you go on about that and your application gets
evaluated. Or yeah.. just make it more expensive, whatever..</li>
</ul>

<p>
And he laughed. We both laughed. And then we just stared at the
reflections of the trees on the water of the lake. We were quite high.
</p>

<p>
But something inside me wasn't cutting it. Couldn't pinpoint
what or why.. but it was definitely (cause of) something.
</p>

<hr />

<p>
Time flew. Now I was moving from clerk to a more stable position
at the Ministry. So much time passed.. and then it happened. The
virus. It spread so quickly and was a global slap in the face. Two
months after the first case and the whole population was in
quarantine. Staying at home. We stayed there. At first to make it
more gradient. And then we almost forgot.
</p>

<p>
Frankly for me it wasn't much of a change, since I was already
working from home. But after a week I felt it as well. My face
missed the sun. The walk in the park. And after the 2nd week, it hit
me.
</p>

<p>
Global population was moving insanely fast. Faster and faster, the
last two centuries. So fast that it was time that we fell and
hit our faces. An incident that would otherwise happen in a certain
area made it to the rest of the world immediately.
</p>

<p>
And that's when I got the idea. Buffers. We need fucking
buffers. You want to visit a place? You get hosted in a buffer
zone. It can be for a week. A light quarantine. You stay there until
you check out. You know what you gain like this?
</p>
<ul class="org-ul">
<li>prevent pandemics</li>
<li>regulate tourism.</li>
</ul>

<p>
And this is where things started to get tricky.
</p>
</blockquote>

<p>
I see&#x2026; So it's the quarantine that started all this.. Or even
before? He said he was already troubled by tourism, so..
</p>

<ul class="org-ul">
<li>Nick: [shouts from a distance] Heyy, what's up!? Didn't see you
yesterday. How are you?</li>
<li>Mark: Hey man.. I'm good! I was mostly reading
yesterday.. and.. thinking. Don't know, my mind is wandering a lot.</li>
<li>N: Yeah, I get you. So.. two more days eh! You excited or what?
You get to see your uncle, right?</li>
<li>M: That's right, yeah, my uncle. I'm quite excited, yeah! [he
let a slight smirk] Hey, by the way, what are you
going to do? You never told me.. and well I never asked you.</li>
<li>N: Well, this trip was quite special. So it's my 3rd one,
right. In my first ones I had made a complete schedule. Where to
go, what to do. The first one was for scuba diving. Getting the
diploma. The second one was about surfing. You see, living in the
north, you don't get to do these things. But these two trips were
to the east, in the free zones. So I got a month off from work
and took the trip. But this one is different.</li>
<li>M: You mean cause of the quarantine?</li>
<li>N: Yeah.. but not only that. I don't know, it's the whole vibe. First I
was terrified about the 1 week quarantine. So I felt the urge of
planning everything, once again. And I felt the need to do so
cause it was going to be 1 week here, so time is precious. The
idea of letting a week of my time go like this, felt
terrifying. But then.. well let's just say that I had an epiphany
that changed my view and.. decided to take this trip as it
goes. No plans. That made the whole quarantine thing feel trivial.</li>
<li>M: Huh.. quite a weird idea.. but.. I think, I get what you
mean. For me it is the opposite, I know exactly what we're going
to do with my uncle, we even had online calls to make our
schedule.</li>
<li>N: Well.. whatever suits each person, man. There's no
recipe. Don't forget that! [He showed a big smile] Well, see you
later, I'm gonna try the yoga class.</li>
<li>Μ: Sure, ciao!.. Hey, one last thing. You ever had like a.. how's
the word.. a premonition? Like an idea or sense of something,
before something happens?</li>
<li>N: Uhm.. maybe.. I think I get this all the time, I just don't
analyze it and.. don't give it any names, heh. See you later.</li>
</ul>
</div>
</div>

<div id="outline-container-orgab5d57a" class="outline-2">
<h2 id="orgab5d57a">Day 6</h2>
<div class="outline-text-2" id="text-orgab5d57a">
<p>
The sun was hitting his face. Hard. He loved this feeling. Laying
there not moving a single finger. Quite slowly he fell asleep&#x2026;
</p>

<p>
His tie seemed crooked so he went on fixing it. One last look in the
mirror, one last breath. He exited the bathroom, an envelope in his
hand, heading towards the last door at the end of the
corridor. Slowly the letters started taking form. "Ministry of
tourism".
Blank.
</p>

<ul class="org-ul">
<li>But that seems quite.. radical, no? Like doing chores in the
army.. People won't like it.</li>
<li>Well, sir, my job isn't to propose what people like, and surely
they won't like it. But this is what I feel needs to be
done. That's the best and my most sincere suggestion that I came
up with. It's up to the people of the future to refine it. Also people
need to understand that not everything comes for free without making
any sacrifice. Cause we had clearly forgotten this.</li>
</ul>

<p>
His body was covered in sweat and had an aftertaste of sleep in his
mouth. He searched for some water and his dream journal. His dream
journal was right underneath the book, so he fetched the book and
postponed the dream writing. After letting out a big yawn, he went
on reading once again.
</p>

<blockquote>
<p>
After delivering my proposal, my first draft, a chain of domino
reactions took place. First, the Ministry of army wanted to get
involved for some reason. They wouldn't let me know why, and never
got any explanations. Also, the Ministry of immigration. That's
when I realized that my proposal bore awful similarities with
refugee camps. What I also noticed is that, while tourists would
have to stay in that camp, let's say for a week, immigrants would
end up spending months there. That, naturally, made me think
of how much time would the upper class end up spending in those
buffer zones.. I think you can guess.
</p>

<p>
My idea quite back-fired. My first "aha" moment thinking about the
buffer zones was that everyone would get to spend the same amount
of time. Cause time is something we equally value. Tax-based
tourism regulation never clicked with me cause monetary resources
are really relative. Time, on the other hand, is a currency we all
share.
</p>

<p>
It was a moment of realization. Realization of my profound
naivety. Took me a while to get over it. And even longer to talk
about it. My means of resolution were to write about it. Go through
my motives and thoughts. Cause that was the best and my most
sincere suggestion that I came up with. It's up to the people of the
future to refine it.
</p>
</blockquote>

<p>
The sun was about to set. He went onto the rooftop of the kitchen,
where you could have an unobstructed view of the disappearing sun.
</p>

<ul class="org-ul">
<li>Nick: Hey there he is. [He seemed eager to welcome him by his
side. He even had a big cushion to share] Last day, tomorrow
we're off!</li>
<li>Mark: Yeah had almost forgotten that. [He paused for some moments
staring at the sun.] Hey Nick.. Do you ever get the feeling that
your time is not exactly your own?</li>
<li>N: Uhm.. in what sense?</li>
<li>M: Not sure yet..</li>
</ul>
</div>
</div>

<div id="outline-container-org099e045" class="outline-2">
<h2 id="org099e045">Day 7</h2>
<div class="outline-text-2" id="text-org099e045">
<p>
The last day felt like a ritual almost. They packed everything,
gathered their bedsheets, dropped them off to the laundry, and went
to the medical center for their last check. Everything seemed normal
with everyone, so no-one was worried. After doing all the checks,
they were asked to pull up their trousers to accommodate the
tracking device on their ankles. That was a new measure which they
didn't know of, and some of them protested. But, in the end, all of
them got out of there with it.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<h2>Comments</h2>
Leave your comments below

<div id="disqus_thread"></div>
<script>
  var disqus_config = function () {
  this.page.url = "";  // Replace PAGE_URL with your page's canonical URL variable
  this.page.identifier = "2004-travel-camps"; // Replace PAGE_IDENTIFIER with your page's unique identifier variable
  };
  
  (function() { // DON'T EDIT BELOW THIS LINE
  var d = document, s = d.createElement('script');
  s.src = 'https://actondev-blog.disqus.com/embed.js';
  s.setAttribute('data-timestamp', +new Date());
  (d.head || d.body).appendChild(s);
  })();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</body>
</html>
